{
  "paper": "2306.15115.txt",
  "words": 15600,
  "extractions": {
    "title": {
      "value": "Energy Sufficiency in Unknown Environments via Control Barrier Functions",
      "justification": "The title accurately reflects the core theme of the paper, which is developing a method to ensure robots have sufficient energy to complete missions in environments where the layout is not known in advance.",
      "quote": "Energy Sufficiency in Unknown Environments via Control Barrier Functions"
    },
    "description": "This paper proposes a framework to guarantee the energy sufficiency of a battery-powered robot during missions in unknown environments. The framework leverages Control Barrier Functions (CBFs) to ensure that the robot does not run out of energy, regardless of the environment or mission. The authors validate their approach through simulations and experiments on a physical AgileX Scout Mini rover.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents an empirical study, validating the proposed framework through simulations and experiments on a physical robot.",
      "quote": "We present results using a physics-based robot simulator, as well as with real robots with a full localization and mapping stack to show the validity of our approach."
    },
    "primary_research_field": {
      "name": {
        "value": "Robot exploration",
        "justification": "The paper focuses on ensuring energy sufficiency for robots during exploration tasks, particularly in unknown and complex environments.",
        "quote": "One way to tackle the issue of unstructured environments in light of energy sufficiency is to perform path planning that incorporates energy cost as one of its metrics."
      },
      "aliases": [
        "Robot exploration"
      ]
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Energy sufficiency",
          "justification": "The core focus of the paper is on methods and frameworks that guarantee a robot's ability to complete missions without running out of energy.",
          "quote": "To this end, endowing robots with the ability to recharge during a mission is of vital importance to enable long term autonomy and successful execution of missions over extended periods of time."
        },
        "aliases": [
          "Energy sufficiency"
        ]
      },
      {
        "name": {
          "value": "Path smoothing",
          "justification": "The paper utilizes path smoothing techniques, such as double sigmoid functions, to refine paths generated by exploration planners and ensure smoother robot movement.",
          "quote": "In practice, we smooth the output of a generic path planner using double sigmoid functions and then use CBFs to ensure energy sufficiency along the smoothed path, for robots described by single integrator and unicycle kinematics."
        },
        "aliases": [
          "Path smoothing"
        ]
      },
      {
        "name": {
          "value": "Path planning",
          "justification": "The paper focuses on path planning methods that incorporate energy costs, enabling robots to navigate efficiently and complete missions within their energy budget.",
          "quote": "One way to tackle the issue of unstructured environments in light of energy sufficiency is to perform path planning that incorporates energy cost as one of its metrics."
        },
        "aliases": [
          "Path planning"
        ]
      },
      {
        "name": {
          "value": "Mission planning",
          "justification": "The paper addresses the broader challenge of planning robot missions while considering energy constraints and ensuring mission completion.",
          "quote": "In this work we present a framework based on Control Barrier Functions (CBFs) that provides an energy sufficiency layer that can be applied on top of any path planner and provides guarantees on the robot’s energy consumption during mission execution."
        },
        "aliases": [
          "Mission planning"
        ]
      }
    ],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 26180
  }
}