{
  "paper": "2308.05741.txt",
  "words": 7824,
  "extractions": {
    "title": {
      "value": "Neural Progressive Meshes",
      "justification": "The title of the paper is clearly stated.",
      "quote": "Neural Progressive Meshes"
    },
    "description": "The paper introduces Neural Progressive Meshes, a novel representation that allows to learn the space of surface details and efficiently compress them into per-face features. These features can be transmitted progressively, enabling the method to iteratively improve the quality of the reconstructed mesh as more data is transmitted. The authors demonstrate that their method is especially effective when only a small fraction of the original shape can be transmitted and outperforms other compression techniques, mesh simplification and subdivision approaches, and progressive mesh representations.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents a new method and conducts experiments to validate it.",
      "quote": "We evaluate our method on the Thingi10K [Zhou and Jacobson 2016] dataset, split into the training, validation, and test sets."
    },
    "primary_research_field": {
      "name": {
        "value": "Computer Graphics",
        "justification": "The paper focuses on transmitting large geometric data, specifically 3D meshes, efficiently. The context mentions applications in virtual and augmented reality on mobile devices.",
        "quote": "The recent proliferation of 3D content that can be consumed on hand-held devices necessitates efficient tools for transmitting large geometric data, e.g., 3D meshes, over the Internet."
      },
      "aliases": [
        "3D content",
        "geometric data",
        "3D meshes",
        "virtual and augmented reality applications",
        "mobile devices"
      ]
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Mesh Compression",
          "justification": "The paper delves into techniques for compressing and simplifying meshes, upsampling surfaces, and applies geometric deep learning principles.",
          "quote": "Mesh decimation and level-of-detail (LoD) techniques are commonly used to reduce the size of a 3D asset either for rendering or transmission efficiency purposes [Garland and Heckbert 1997; Lescoat et al. 2020]."
        },
        "aliases": [
          "Mesh compression",
          "Mesh simplification",
          "Surface upsampling",
          "Geometric deep learning"
        ]
      }
    ],
    "models": [
      {
        "name": {
          "value": "Neural Progressive Meshes",
          "justification": "The paper refers to the model as \\\"Neural Progressive Meshes\\\".",
          "quote": "We propose Neural Progressive Meshes, a novel representation that allows us to learn the space of surface details and efficiently compress them into per-face features."
        },
        "aliases": [],
        "is_contributed": {
          "value": true,
          "justification": "The paper proposes Neural Progressive Meshes, a novel representation for compressing and progressively transmitting mesh details.",
          "quote": "We propose Neural Progressive Meshes, a novel representation that allows us to learn the space of surface details and efficiently compress them into per-face features."
        },
        "is_executed": {
          "value": true,
          "justification": "The authors implement and evaluate Neural Progressive Meshes, comparing its performance to various baselines.",
          "quote": "We demonstrate that our method is especially effective when only a small fraction of the original shape can be transmitted and outperforms other compression techniques, mesh simplification and subdivision approaches, and progressive mesh representations."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares their method to Neural Subdivision.",
          "quote": "We find the learnable subdivision method (Neural Subdivision [Liu et al. 2020]) further improves the accuracy."
        },
        "referenced_paper_title": {
          "value": "",
          "justification": "No paper is referenced for this model.",
          "quote": "No quote found."
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 14943
  }
}