{
  "paper": "2312.04574.txt",
  "words": 9808,
  "extractions": {
    "title": {
      "value": "Differentiable Visual Computing for Inverse Problems and Machine Learning",
      "justification": "The title of the paper is extracted from the first page of the document.",
      "quote": "Differentiable Visual Computing for Inverse Problems and Machine Learning"
    },
    "description": "This paper surveys differentiable visual computing (DVC) methods which bring together modern deep learning techniques and 3D computer graphics technologies to solve problems in optimal control, object detection, scene understanding, and more. It provides a unified, holistic differentiable visual computing pipeline by drawing parallels between the well-established computer graphics pipeline and a unified differentiable graphics pipeline.",
    "type": {
      "value": "theoretical",
      "justification": "The paper is a survey of existing and possible applications of DVC.",
      "quote": "We survey this growing body of work and propose a holistic and unified differentiable visual computing pipeline."
    },
    "primary_research_field": {
      "name": {
        "value": "Visual Computing",
        "justification": "The paper focuses on differentiable methods for visual computing problems.",
        "quote": "We present our vision of a complete differentiable visual computing pipeline, shown in Fig. 1 that combines advances in differentiable geometry, animation, and physics not only to generate visual content, but to efficiently understand and improve it using gradient-based information."
      },
      "aliases": []
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Deep Learning",
          "justification": "The paper focuses on differentiable visual computing methods that leverage deep learning techniques.",
          "quote": "DVC combines the accurate, compact and explicit models of reality with system parameterization and gradients needed to adapt their parameters, i.e., using gradient-based optimization."
        },
        "aliases": []
      },
      {
        "name": {
          "value": "Geometry Processing",
          "justification": "The paper focuses on differentiable geometry processing as part of the visual computing pipeline.",
          "quote": "We proceed by reviewing preliminaries on differentiable programming; we then expand on the vision of the DVC pipeline and review state-of-the art methods for its constituent parts, and conclude with the state of the field, including infrastructure, challenges, and opportunities."
        },
        "aliases": []
      },
      {
        "name": {
          "value": "Animation",
          "justification": "The paper focuses on animation as part of the differentiable visual computing pipeline.",
          "quote": "DVC enables each computer graphics process to be differentiable, as well as the end-to-end pipeline."
        },
        "aliases": []
      },
      {
        "name": {
          "value": "Rendering",
          "justification": "The paper focuses on rendering as part of the differentiable visual computing pipeline.",
          "quote": "The building block computation nodes (cf neurons) in DVC models include geometry processing, physics-based animation, and image synthesis (more commonly referred to as rendering; see Fig. 1.)"
        },
        "aliases": []
      }
    ],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 17479
  }
}