{
  "paper": "2401.01281.txt",
  "words": 7305,
  "extractions": {
    "title": {
      "value": "Influence of scanning plane on Human Spinal Cord functional Magnetic Resonance echo planar imaging",
      "justification": "The paper's title is \\\"Influence of scanning plane on Human Spinal Cord functional Magnetic Resonance echo planar imaging\\\".",
      "quote": "Influence of scanning plane on Human Spinal Cord functional Magnetic Resonance echo planar imaging"
    },
    "description": "The paper investigates the use of fMRI for studying the human spinal cord. The study compares axial and sagittal scanning planes in terms of data quality and reproducibility. The authors conclude that axial scanning is advantageous for mitigating physiological noise and minimizing inter-subject variance. The study utilized the Spinal Cord Toolbox (SCT) for data analysis.",
    "type": {
      "value": "empirical",
      "justification": "The paper is empirical as it involves experimental measurements and data analysis.",
      "quote": "This study was aimed at systematically verify whether sagittal scanning in scfMRI using EPI readout is a viable alternative to the more common axial scanning, and at optimizing a pipeline for EPI-based scfMRI data analysis, based on Spinal Cord Toolbox (SCT)."
    },
    "primary_research_field": {
      "name": {
        "value": "Medical Imaging",
        "justification": "The primary research field of the paper is Medical Imaging, specifically focusing on fMRI.",
        "quote": "Functional Magnetic Resonance Imaging (fMRI) is based on the Blood Oxygenation Level Dependent contrast and has been exploited for the indirect study of the neuronal activity within both the brain and the spinal cord."
      },
      "aliases": []
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": [
      {
        "name": {
          "value": "Spinal Cord Toolbox",
          "justification": "The paper mentions the use of the Spinal Cord Toolbox (SCT) for data analysis.",
          "quote": "Additionally, we implemented and optimized a pipeline for scfMRI EPI data analysis based on SCT."
        },
        "aliases": [],
        "role": "used",
        "referenced_paper_title": {
          "value": "SCT: Spinal Cord Toolbox, an open-source software for processing spinal cord MRI data",
          "justification": "The paper references the SCT.",
          "quote": "De Leener B, Lévy S, Dupont SM, et al. SCT: Spinal Cord Toolbox, an open-source software for processing spinal cord MRI data. Neuroimage. 2017;145(Pt A):24-43. doi:10.1016/j.neuroimage.2016.10.009"
        }
      }
    ]
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 13804
  }
}