{
  "paper": "2108.11107.txt",
  "words": 14910,
  "extractions": {
    "title": {
      "value": "Precision measurements and tau neutrino physics in a future accelerator neutrino experiment",
      "justification": "The paper investigates the prospects of building a future accelerator-based neutrino oscillation experiment in China.",
      "quote": "Precision measurements and tau neutrino physics in a future accelerator neutrino experiment"
    },
    "description": "This research paper explores the potential for a future accelerator-based neutrino oscillation experiment in China. The authors consider various locations for both the accelerator and the detector, focusing on the physics potential of different baseline lengths. The study examines muon-decay and beta-decay neutrino beam techniques and investigates their sensitivity to CP violation, standard oscillation parameters (θ23, δCP, Δm231), non-unitary neutrino mixing, and non-standard neutrino interactions. The paper also proposes a concrete experimental setup called PROMPT (Precision Measurements and Physics with Tau neutrinos), which utilizes a muon-decay-based neutrino beam from the SPPC injector chain and a hybrid detector (magnetized iron and emulsion cloud chamber) located at the CJPL site with a baseline length of 1736 km.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents simulations and analysis of different experimental setups, making it an empirical study.",
      "quote": "We simulate neutrino beam setups based on muon and beta decay techniques and compare Chinese laboratory sites by their expected sensitivities."
    },
    "primary_research_field": {
      "name": {
        "value": "Neutrino oscillation",
        "justification": "The paper investigates the prospects of building a future accelerator-based neutrino oscillation experiment in China.",
        "quote": "We investigate the prospects of building a future accelerator-based neutrino oscillation experiment in China, including site selection, beam optimization and tau neutrino physics aspects."
      },
      "aliases": [
        "Neutrino oscillation"
      ]
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 27432
  }
}