{
  "paper": "2205.08830.txt",
  "words": 13226,
  "extractions": {
    "title": {
      "value": "Prospects for Detecting the Diffuse Supernova Neutrino Background with JUNO",
      "justification": "This is the title of the paper.",
      "quote": "Prospects for Detecting the Diffuse Supernova Neutrino Background with JUNO"
    },
    "description": "This paper investigates the potential of the Jiangmen Underground Neutrino Observatory (JUNO) to detect the diffuse supernova neutrino background (DSNB). They use the inverse-beta-decay (IBD) detection channel on free protons and take into account the latest information on the DSNB flux predictions. The background and its reduction for the DSNB search at JUNO are investigated in detail. The atmospheric neutrino induced neutral current (NC) background is identified as the most critical background. The authors evaluate its uncertainty using the spread of model predictions and an envisaged in situ measurement. They also study background suppression using pulse shape discrimination (PSD) and triple coincidence (TC) cuts. The paper concludes that JUNO can reach a significance of 3σ for 3 years of data taking and achieve better than 5σ after 10 years for a reference DSNB model. In a pessimistic scenario of non-observation, JUNO would still improve the limits and exclude a significant region of the model parameter space.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents simulations and analysis of data, classifying it as empirical research.",
      "quote": "We present the detection potential for the diffuse supernova neutrino background (DSNB) at the Jiangmen Underground Neutrino Observatory (JUNO), using the inverse-beta-decay (IBD)\\ndetection channel on free protons."
    },
    "primary_research_field": {
      "name": {
        "value": "Astroparticle Physics",
        "justification": "The paper focuses on detecting neutrinos from supernovae, a key subject within astroparticle physics.",
        "quote": "The detection of DSNB signals is important for the cosmology."
      },
      "aliases": []
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 24307
  }
}