{
  "paper": "2210.15837.txt",
  "words": 9245,
  "extractions": {
    "title": {
      "value": "Risk-Aware Bid Optimization for Online Display Advertisement",
      "justification": "The paper's title is clearly stated at the beginning.",
      "quote": "Risk-Aware Bid Optimization for Online Display Advertisement"
    },
    "description": "This paper focuses on the bid optimization problem in the real-time bidding setting for online display advertisements. The authors propose a risk-aware data-driven bid optimization model that maximizes the expected profit for the advertiser, accounting for the risk of violating the budget constraint during a given period of time. They demonstrate their model\\'s effectiveness on a real-world dataset, showing that it can effectively control the risk of overspending the budget while achieving a competitive level of profit.",
    "type": {
      "value": "empirical",
      "justification": "The paper emphasizes data-driven methods and presents experimental results based on a real-world dataset, indicating its empirical nature.",
      "quote": "Using a real-world dataset, we demonstrate that our risk-averse method can effectively control the risk of overspending the budget while achieving a competitive level of profit compared with the risk-neutral model and a state-of-the-art data-driven risk-aware bidding approach."
    },
    "primary_research_field": {
      "name": {
        "value": "Online Display Advertisement",
        "justification": "The title explicitly states \\\"Online Display Advertisement\\\" as the problem domain.",
        "quote": "Risk-Aware Bid Optimization for Online Display Advertisement"
      },
      "aliases": [
        "Online Display Advertisement"
      ]
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Risk Management in Advertising",
          "justification": "The paper explicitly lists these as keywords, directly indicating their relevance as sub-research fields within the broader context of online display advertising.",
          "quote": "Keywords: Risk-aware Bidding policy, Risk Aversion, Display Advertising, Machine Learning, Entropic Risk Measure, Lagrangian Relaxation, Real-Time Bidding"
        },
        "aliases": [
          "Risk-Aware Bidding policy",
          "Risk Aversion",
          "Machine Learning",
          "Entropic Risk Measure",
          "Lagrangian Relaxation",
          "Real-Time Bidding"
        ]
      },
      {
        "name": {
          "value": "Predictive Modeling in Advertising",
          "justification": "The paper extensively discusses these prediction tasks as crucial components for bid optimization in display advertising, highlighting their role as sub-research fields.",
          "quote": "Our literature review covers the three main topics of this paper. CTR and winning price prediction"
        },
        "aliases": [
          "CTR prediction",
          "winning price prediction",
          "bid landscape problem"
        ]
      }
    ],
    "models": [
      {
        "name": {
          "value": "DeepFM",
          "justification": "The paper explicitly names DeepFM as the chosen model for estimating CTR.",
          "quote": "In the context of this work, we will employ a DeepFM model [Guo et al., 2017] to estimate θ(X)."
        },
        "aliases": [
          "DeepFM"
        ],
        "is_contributed": {
          "value": false,
          "justification": "The paper doesn't introduce DeepFM as a novel contribution, but rather leverages its existing capabilities for CTR prediction.",
          "quote": "In the context of this work, we will employ a DeepFM model [Guo et al., 2017] to estimate θ(X)."
        },
        "is_executed": {
          "value": true,
          "justification": "The paper provides experimental results that demonstrate the application of DeepFM for CTR estimation, indicating its execution within the scope of the research.",
          "quote": "The estimators θ(X), ŵ(X), σ(X) are trained and Lagrangian parameter λ optimized using the Training set (3,083,056 observations), while other hyperparameters are tuned using the Validation set (307,319 observations)."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper discusses DeepFM as a model for CTR estimation and compares its suitability to other approaches like linear-based, tree-based, and Factorization Machines.",
          "quote": "In the context of this work, we will employ a DeepFM model [Guo et al., 2017] to estimate θ(X). We note that this choice is not limiting and that other CTR prediction models could also be employed if one can improve the accuracy."
        },
        "referenced_paper_title": {
          "value": "DeepFM: A Factorization-Machine based Neural Network for CTR Prediction",
          "justification": "The paper cites the work by Guo et al. (2017) in conjunction with the use of DeepFM.",
          "quote": "In the context of this work, we will employ a DeepFM model [Guo et al., 2017] to estimate θ(X)."
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 17381
  }
}