{
  "paper": "2212.06079.txt",
  "words": 11869,
  "extractions": {
    "title": {
      "value": "Robust Perception through Equivariance",
      "justification": "The paper's title clearly reflects its central theme: achieving robust perception through the principle of equivariance.",
      "quote": "Robust Perception through Equivariance"
    },
    "description": "The paper focuses on enhancing the robustness of deep networks, particularly against adversarial examples, by leveraging the concept of equivariance. The authors argue that while deep networks excel in computer vision benchmarks, they often fail in real-world scenarios due to their vulnerability to adversarial attacks. They propose a method that shifts the burden of robustness from the training phase to the inference phase. The core idea is to utilize the dense intrinsic constraints found in natural images, particularly equivariance under spatial transformations. The paper provides theoretical analysis and conducts empirical experiments on four datasets: ImageNet, Cityscapes, PASCAL VOC, and MS-COCO. The results demonstrate that restoring feature equivariance at inference time significantly improves the model\\'s robustness against adversarial perturbations.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents both theoretical analysis and empirical experiments to validate the proposed approach.",
      "quote": "Our empirical experiments show that restoring feature equivariance at inference time defends against worst-case adversarial perturbations."
    },
    "primary_research_field": {
      "name": {
        "value": "Computer Vision",
        "justification": "The paper focuses on enhancing the robustness of deep networks in the context of computer vision.",
        "quote": "Deep networks for computer vision are not reliable when they encounter adversarial examples."
      },
      "aliases": [
        "computer vision"
      ]
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 22299
  }
}