{
  "paper": "2301.09257.txt",
  "words": 5254,
  "extractions": {
    "title": {
      "value": "Real-Time Simultaneous Localization and Mapping with LiDAR Intensity",
      "justification": "This is the title extracted from the paper.",
      "quote": "Real-Time Simultaneous Localization and Mapping with LiDAR Intensity"
    },
    "description": "The paper presents a novel real-time LiDAR intensity image-based simultaneous localization and mapping method that addresses the geometry degeneracy problem in unstructured environments. The method leverages LiDAR intensity images to extract feature points, which are then used for scan registration, egomotion estimation, loop closure detection, and pose graph optimization. The authors argue that using intensity images can help overcome the limitations of traditional LiDAR-based methods that rely solely on geometric features, particularly in environments with limited structural information. The proposed method has been evaluated in various environments, including indoor, outdoor, and extreme scenarios such as long corridors, demonstrating competitive performance compared to other state-of-the-art LiDAR SLAM methods like LeGO-LOAM and A-LOAM.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents an empirical evaluation of their novel LiDAR SLAM method. They describe the implementation of the method and conduct experiments to validate its effectiveness in various environments. The paper includes details about the experimental setup, datasets used, and comparisons with existing methods. The findings are supported by quantitative results, including trajectory plots and absolute position error measurements.",
      "quote": "Our experiments show that our method can run in real time with high accuracy and works well with illumination changes, low-texture, and unstructured environments."
    },
    "primary_research_field": {
      "name": {
        "value": "SLAM",
        "justification": "The paper focuses on Simultaneous Localization and Mapping (SLAM), a fundamental problem in robotics, particularly within the domain of autonomous navigation.",
        "quote": "Simultaneous Localization and Mapping (SLAM) is a fundamental problem in robotics."
      },
      "aliases": []
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 9614
  }
}