{
  "paper": "2301.06230.txt",
  "words": 7018,
  "extractions": {
    "title": {
      "value": "Swarm-SLAM: Sparse Decentralized Collaborative Simultaneous Localization and Mapping Framework for Multi-Robot Systems",
      "justification": "Extracted from the paper's title.",
      "quote": "Swarm-SLAM: Sparse Decentralized Collaborative Simultaneous Localization and Mapping Framework for Multi-Robot Systems"
    },
    "description": "This paper proposes Swarm-SLAM, a collaborative simultaneous localization and mapping (C-SLAM) system for multi-robot systems in GPS-denied environments. The system is designed to be scalable, flexible, decentralized, and sparse, making it suitable for swarm robotics applications. Swarm-SLAM supports lidar, stereo, and RGB-D sensing, and it includes a novel inter-robot loop closure prioritization technique that reduces communication and accelerates convergence. The paper presents evaluations of Swarm-SLAM on five different datasets and in a real-world experiment with three robots communicating through an ad-hoc network.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents and evaluates Swarm-SLAM, a C-SLAM system.",
      "quote": "In this paper, we introduce Swarm-SLAM, an open-source C-SLAM system that is designed to be scalable, flexible, decentralized, and sparse, which are all key properties in swarm robotics."
    },
    "primary_research_field": {
      "name": {
        "value": "Simultaneous Localization and Mapping",
        "justification": "The paper presents a C-SLAM system designed for multi-robot systems, with a focus on swarm robotics.",
        "quote": "Swarm-SLAM: Sparse Decentralized Collaborative Simultaneous Localization and Mapping Framework for Multi-Robot Systems"
      },
      "aliases": [
        "SLAM",
        "Multi-Robot Systems",
        "Collaborative Perception",
        "Swarm Intelligence"
      ]
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 12494
  }
}