{
  "paper": "2306.11128.txt",
  "words": 8248,
  "extractions": {
    "title": {
      "value": "CAMMARL: Conformal Action Modeling in Multi Agent Reinforcement Learning",
      "justification": "The title of the paper is 'CAMMARL: Conformal Action Modeling in Multi Agent Reinforcement Learning'.",
      "quote": "CAMMARL : Conformal Action Modeling in\\n\\nMulti Agent Reinforcement Learning"
    },
    "description": "This research paper proposes CAMMARL, a novel multi-agent reinforcement learning (MARL) algorithm that leverages conformal prediction to model the actions of other agents in an environment, enhancing decision-making in cooperative settings. The authors demonstrate CAMMARL\\'s effectiveness in two multi-agent tasks: Cooperative Navigation and Level-based Foraging. The paper does not introduce new datasets or libraries but emphasizes agent modeling using conformal prediction.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents empirical results based on experiments, making it an empirical study.",
      "quote": "Through several experiments in two fully cooperative multi-agent tasks, we show that CAMMARL elevates the capabilities of an autonomous agent in MARL by modeling conformal prediction sets over the behavior of other agents in the environment and utilizing such estimates to enhance its policy learning."
    },
    "primary_research_field": {
      "name": {
        "value": "Multi-agent reinforcement learning",
        "justification": "The primary research field is multi-agent reinforcement learning.",
        "quote": "multi-agent reinforcement learning (MARL)"
      },
      "aliases": [
        "MARL"
      ]
    },
    "sub_research_fields": [],
    "models": [
      {
        "name": {
          "value": "CAMMARL",
          "justification": "The paper refers to the proposed algorithm as CAMMARL.",
          "quote": "CAM MARL"
        },
        "aliases": [
          "CAMMARL"
        ],
        "is_contributed": {
          "value": true,
          "justification": "The paper proposes CAMMARL as a novel MARL algorithm.",
          "quote": "In this article, we propose a novel multi-agent reinforcement learning (MARL) algorithm CAM MARL, which involves modeling the actions of other agents in different situations in the form of confident sets, i.e., sets containing their true actions with a high probability."
        },
        "is_executed": {
          "value": true,
          "justification": "The paper provides experimental results of CAMMARL in two cooperative multi-agent tasks: Cooperative Navigation and Level-based Foraging.",
          "quote": "Through several experiments in two fully cooperative multi-agent tasks, we show that CAMMARL elevates the capabilities of an autonomous agent in MARL by modeling conformal prediction sets over the behavior of other agents in the environment and utilizing such estimates to enhance its policy learning."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares CAMMARL with several other methods, including NOAM, TAAM, TOAM, GIAM, and EAP.",
          "quote": "To show the benefits of conformal action set prediction, we compare CAMMARL with the performances of agents in different settings with varying pieces of information made available to Nself during training."
        },
        "referenced_paper_title": {
          "value": "",
          "justification": "No specific paper is referenced for CAMMARL, as it is a novel contribution of this work.",
          "quote": ""
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 14065
  }
}