{
  "paper": "2306.01112.txt",
  "words": 11973,
  "extractions": {
    "title": {
      "value": "Improving day-ahead Solar Irradiance Time Series Forecasting by Leveraging Spatio-Temporal Context",
      "justification": "This is the title of the paper.",
      "quote": "Improving day-ahead Solar Irradiance Time Series Forecasting by Leveraging Spatio-Temporal Context"
    },
    "description": "Solar power is becoming increasingly important as a renewable energy source, with the potential to reduce greenhouse gas emissions. However, the variability of solar irradiance presents a challenge for integrating it into the grid. Accurate solar irradiance forecasting can assist grid operators in managing this variability, leading to more efficient and reliable integration of solar power. The paper focuses on using deep learning for solar irradiance time-series forecasting by leveraging spatio-temporal context, such as satellite data, alongside historical time-series data from multiple stations. The proposed architecture, called CrossViViT, aims to enhance the prediction of future time series for solar irradiance by integrating historical time-series data with video clips of spatio-temporal physical context. The paper also introduces a new multi-modal dataset that combines satellite imagery with solar irradiance and other physical variables from multiple geographically diverse solar stations. The dataset covers a period of 14 years and aims to facilitate the development and evaluation of new multi-modal forecasting models for solar irradiance. Experimental results demonstrate the effectiveness of the proposed CrossViViT architecture, showing superior performance compared to several state-of-the-art deep learning architectures specifically designed for forecasting tasks.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents a new model and dataset for solar irradiance forecasting, and conducts experiments to evaluate its performance. This suggests an empirical approach.",
      "quote": "We experimentally show that the proposed approach can generalize to a new station not seen during training in a zero-shot generalization forecasting setting."
    },
    "primary_research_field": {
      "name": {
        "value": "Time Series Forecasting",
        "justification": "The paper focuses on forecasting solar irradiance, which is a time series forecasting problem.",
        "quote": "Our focus is on the application of machine learning to time-series forecasting, with a particular emphasis on utilizing multi-modal spatio-temporal data that includes physical, weather, and remotely sensed variables."
      },
      "aliases": [
        "Time Series Forecasting",
        "Solar Irradiance Forecasting"
      ]
    },
    "sub_research_fields": [],
    "models": [
      {
        "name": {
          "value": "CrossViViT",
          "justification": "The authors refer to their model as CrossViViT throughout the paper.",
          "quote": "We present a deep learning architecture called CrossViViT, designed to leverage spatiotemporal context (such as satellite data) in order to achieve highly accurate medium-term (1 day horizon) time-series forecasting at any given station."
        },
        "aliases": [
          "CrossViViT"
        ],
        "is_contributed": {
          "value": true,
          "justification": "The authors present CrossViViT, a deep learning architecture for solar irradiance forecasting.",
          "quote": "We present CrossViViT, an architecture for accurate day-ahead time-series forecasting of solar irradiance using the spatio-temporal context derived from satellite data."
        },
        "is_executed": {
          "value": true,
          "justification": "The paper provides details on the training setup and hyperparameters used for CrossViViT.",
          "quote": "CrossViViT was trained on two RTX8000 GPUs, over 17 epochs with early stopping."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares the performance of CrossViViT with several state-of-the-art time series models.",
          "quote": "We conduct a comprehensive comparison between our approach and several state-of-the-art deep learning architectures specifically designed for forecasting tasks."
        },
        "referenced_paper_title": {
          "value": "Null",
          "justification": "No paper title is referenced for CrossViViT.",
          "quote": "Null"
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 26332
  }
}