{
  "paper": "2307.00134.txt",
  "words": 11837,
  "extractions": {
    "title": {
      "value": "Generalization Limits of Graph Neural Networks in Identity Effects Learning",
      "justification": "This is the title of the paper.",
      "quote": "None"
    },
    "description": "The paper investigates the generalization limits of Graph Neural Networks (GNNs) in learning so-called identity effects. The study analyzes two case studies: (i) two-letters words and (ii) dicyclic graphs. The authors provide theoretical analysis and numerical experiments to support their findings.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents both theoretical results and experimental validation, making it empirical.",
      "quote": "Our theoretical analysis is supported by an extensive numerical study."
    },
    "primary_research_field": {
      "name": {
        "value": "Graph-based Learning",
        "justification": "The paper focuses on Graph Neural Networks, which fall under the broader field of Graph-based learning.",
        "quote": "Graph Neural Networks (GNNs) have emerged as a powerful tool for data-driven learning on various graph domains."
      },
      "aliases": [
        "Graph-based Learning"
      ]
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Generalization in Graph Neural Networks",
          "justification": "The paper investigates the generalization limits of Graph Neural Networks (GNNs), which is a subfield within Graph Neural Networks.",
          "quote": "In this work, we establish new generalization properties and fundamental limits of GNNs in the context of learning so-called identity effects"
        },
        "aliases": [
          "Generalization in Graph Neural Networks"
        ]
      }
    ],
    "models": [
      {
        "name": {
          "value": "Graph Neural Network",
          "justification": "The paper focuses on Graph Neural Networks (GNNs) in general.",
          "quote": "Graph Neural Networks (GNNs) have emerged as a powerful tool for data-driven learning on various graph domains."
        },
        "aliases": [],
        "is_contributed": {
          "value": false,
          "justification": "The paper does not introduce any new GNN architecture.",
          "quote": "None"
        },
        "is_executed": {
          "value": true,
          "justification": "The paper uses GNNs in the experiments.",
          "quote": "Our theoretical analysis is supported by an extensive numerical study."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares the performance of GNNs with Multilayer Perceptrons (MLPs) and Recurrent Neural Networks (RNNs) in learning identity effects.",
          "quote": "Recently, it has been shown in [44] that Multilayer Perceptrons (MLPs) and Recurrent Neural Networks (RNNs) cannot learn identity effects via Stochastic Gradient Descent nor Adam, under certain conditions on the encoding utilized to represent the components of objects."
        },
        "referenced_paper_title": {
          "value": "None",
          "justification": "The paper does not reference a specific paper for GNNs.",
          "quote": "None"
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 22403
  }
}