{
  "paper": "2307.05769.txt",
  "words": 6009,
  "extractions": {
    "title": {
      "value": "Joint Machine-Transporter Scheduling for Multistage Jobs with Adjustable Computation Time",
      "justification": "The paper's title reflects the core focus on scheduling and assigning machines and transporters for multi-stage tasks.",
      "quote": "Joint Machine-Transporter Scheduling for Multistage Jobs with Adjustable Computation Time"
    },
    "description": "Joint Machine-Transporter Scheduling for Multistage Jobs with Adjustable Computation Time\\n\\narXiv:2307.05769v1 [cs.RO] 11 Jul 2023\\n\\nKoresh Khateri and Giovanni Beltrame Abstract— This paper presents a scalable solution with adjustable computation time for the joint problem of scheduling and assigning machines and transporters for missions that must be completed in a fixed order of operations across multiple stages. A battery-operated multi-robot system with a maximum travel range is employed as the transporter between stages and charging them is considered as an operation. Robots are assigned to a single job until its completion. Additionally, The operation completion time is assumed to be dependent on the machine and the type of operation, but independent of the job.\\nThis work aims to minimize a weighted multi-objective goal that includes both the required time and energy consumed by the transporters. This problem is a variation of the flexible flow shop with transports, that is proven to be NP-complete.\\nTo provide a solution, time is discretized, the solution space is divided temporally, and jobs are clustered into diverse groups.\\nFinally, an integer linear programming solver is applied within a sliding time window to determine assignments and create a schedule that minimizes the objective. The computation time can be reduced depending on the number of jobs selected at each segment, with a trade-off on optimality. The proposed algorithm finds its application in a water sampling project,\\nwhere water sampling jobs are assigned to robots, sample deliveries at laboratories are scheduled, and the robots are routed to charging stations.",
    "type": {
      "value": "empirical",
      "justification": "The paper proposes and evaluates an algorithm through simulations, making it empirical.",
      "quote": "This paper presents a scalable solution with adjustable computation time for the joint problem of scheduling and assigning machines and transporters for missions that must be completed in a fixed order of operations across multiple stages."
    },
    "primary_research_field": {
      "name": {
        "value": "Scheduling",
        "justification": "The paper focuses on developing an algorithm for scheduling and assigning tasks within a multi-stage process.",
        "quote": "This paper presents a scalable solution with adjustable computation time for the joint problem of scheduling and assigning machines and transporters for missions that must be completed in a fixed order of operations across multiple stages."
      },
      "aliases": [
        "scheduling"
      ]
    },
    "sub_research_fields": [],
    "models": [],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 10598
  }
}