{
  "paper": "2308.08708.txt",
  "words": 41462,
  "extractions": {
    "title": {
      "value": "Consciousness in Artificial Intelligence: Insights from the Science of Consciousness",
      "justification": "This is the title of the research paper.",
      "quote": "Consciousness in Artificial Intelligence: Insights from the Science of Consciousness"
    },
    "description": "This report discusses the possibility of consciousness in artificial intelligence, drawing on prominent scientific theories of consciousness, such as recurrent processing theory, global workspace theory, and higher-order theories. The report provides a framework for evaluating AI systems for consciousness based on \"indicator properties\" derived from these theories and assesses several recent AI systems, including large language models and embodied agents.",
    "type": {
      "value": "theoretical",
      "justification": "The report draws on theoretical and empirical evidence from neuroscience and applies it to AI.",
      "quote": "This report argues for, and exemplifies, a rigorous and empirically grounded approach to AI consciousness: assessing existing AI systems in detail, in light of our best-supported neuroscientific theories of consciousness."
    },
    "primary_research_field": {
      "name": {
        "value": "Artificial Intelligence",
        "justification": "The report focuses on assessing consciousness in artificial intelligence.",
        "quote": "Whether current or near-term AI systems could be conscious is a topic of scientific interest and increasing public concern."
      },
      "aliases": [
        "AI",
        "Artificial Intelligence"
      ]
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Consciousness in AI",
          "justification": "The report specifically assesses the possibility of consciousness in artificial intelligence.",
          "quote": "This report is about what we take to be the best scientific evidence for and against consciousness in current and near-term AI systems."
        },
        "aliases": [
          "Consciousness in AI",
          "AI Consciousness"
        ]
      },
      {
        "name": {
          "value": "Neuroscience of Consciousness",
          "justification": "The report heavily relies on neuroscientific theories of consciousness.",
          "quote": "We describe prominent theories of this kind and investigate their implications for AI."
        },
        "aliases": [
          "Neuroscience of Consciousness",
          "Scientific Theories of Consciousness"
        ]
      }
    ],
    "models": [
      {
        "name": {
          "value": "Various AI Models and Systems",
          "justification": "The report assesses various AI models and systems.",
          "quote": "We use these indicator properties to assess several recent AI systems, and we discuss how future systems might implement them."
        },
        "aliases": [
          "GPT-3",
          "GPT-4",
          "LaMDA",
          "ChatGPT",
          "PaLM",
          "AlexNet",
          "AlphaGo",
          "PredNet",
          "MONet",
          "DALL-E 2",
          "Object Scene Representation Transformer",
          "Perceiver",
          "Perceiver IO",
          "AdA"
        ],
        "is_contributed": {
          "value": false,
          "justification": "The report focuses on assessing existing AI systems, not contributing new ones.",
          "quote": "We use these indicator properties to assess several recent AI systems, and we discuss how future systems might implement them."
        },
        "is_executed": {
          "value": true,
          "justification": "The report mentions several AI systems and how they perform on various tasks, indicating their execution.",
          "quote": "These systems include Transformer-based large language models and the Perceiver architecture, which we analyse with respect to the global workspace theory. We also analyse DeepMind’s Adaptive Agent, which is a reinforcement learning agent operating in a 3D virtual environment; a system trained to perform tasks by controlling a virtual rodent body; and PaLM-E, which has been described as an “embodied multimodal language model”."
        },
        "is_compared": {
          "value": true,
          "justification": "The authors assess various AI systems for consciousness.",
          "quote": "We use these indicator properties to assess several recent AI systems, and we discuss how future systems might implement them."
        },
        "referenced_paper_title": {
          "value": "N/A",
          "justification": "The report doesn't focus on any specific model's referenced paper.",
          "quote": "N/A"
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 61146
  }
}