{
  "paper": "2310.12294.txt",
  "words": 7920,
  "extractions": {
    "title": {
      "value": "Open-Set Multivariate Time-Series Anomaly Detection",
      "justification": "The paper's title clearly indicates its focus on open-set anomaly detection in the context of multivariate time series.",
      "quote": "Open-Set Multivariate Time-Series Anomaly Detection"
    },
    "description": "This paper targets the open-set time-series anomaly detection (OSAD) problem, where a small number of labeled anomalies are used during training to enhance anomaly detection performance. The authors introduce MOSAD, a multi-head framework incorporating Generative, Discriminative, and Anomaly-Aware Contrastive heads, to effectively detect both seen and unseen anomaly classes. Experiments on three real-world datasets (SMD, PTB-XL, and TUSZ) demonstrate MOSAD\\'s superior performance over existing unsupervised and supervised TSAD methods, establishing a new state-of-the-art in the field.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents a novel model and conducts extensive experiments to validate its performance, demonstrating its empirical nature.",
      "quote": "Extensive experiments on three realworld datasets establish MOSAD as a new state-of-the-art in the TSAD field."
    },
    "primary_research_field": {
      "name": {
        "value": "Time-series anomaly detection",
        "justification": "The paper explicitly focuses on Time-series anomaly detection (TSAD), emphasizing its application in an open-set setting.",
        "quote": "This paper is the first to address the open-set TSAD problem, in which a small number of labeled anomalies are introduced in the training phase in order to achieve superior anomaly detection performance compared to both supervised and unsupervised TSAD algorithms."
      },
      "aliases": [
        "TSAD",
        "Time-series anomaly detection",
        "OSAD",
        "Open-set anomaly detection"
      ]
    },
    "sub_research_fields": [],
    "models": [
      {
        "name": {
          "value": "MOSAD",
          "justification": "The paper names the proposed model as MOSAD, which stands for Multivariate time-series Open-Sset Anomaly Detector.",
          "quote": "To address this gap, we propose the first open-set TSAD algorithm named Multivariate time-series Open-Sset Anomaly Detector (MOSAD)."
        },
        "aliases": [
          "MOSAD",
          "Multivariate time-series Open-Sset Anomaly Detector",
          "MOSADVSC"
        ],
        "is_contributed": {
          "value": true,
          "justification": "The authors present MOSAD as a novel contribution, outlining its architecture, components, and advantages in detail.",
          "quote": "To address this gap, we propose the first open-set TSAD algorithm named Multivariate time-series Open-Sset Anomaly Detector (MOSAD)."
        },
        "is_executed": {
          "value": true,
          "justification": "The paper provides extensive experimental results, demonstrating MOSAD's effectiveness on three real-world datasets and comparing it to various baselines.",
          "quote": "Extensive experiments on three realworld datasets establish MOSAD as a new state-of-the-art in the TSAD field."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper proposes and describes the MOSAD model for open-set time-series anomaly detection, highlighting its superior performance compared to existing methods.",
          "quote": "To address this gap, we propose the first open-set TSAD algorithm named Multivariate time-series Open-Sset Anomaly Detector (MOSAD)."
        },
        "referenced_paper_title": {
          "value": "None",
          "justification": "The model is proposed in this paper, hence no referenced paper title.",
          "quote": "None"
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 16170
  }
}