{
  "paper": "2311.18012.txt",
  "words": 7143,
  "extractions": {
    "title": {
      "value": "Bayesian Imaging for Radio Interferometry with Score-Based Priors",
      "justification": "The title is extracted from the paper.",
      "quote": "Bayesian Imaging for Radio Interferometry with Score-Based Priors"
    },
    "description": "The inverse imaging task in radio interferometry is a key limiting factor to retrieving Bayesian uncertainties in radio astronomy in a computationally effective manner.\\nWe use a score-based prior derived from optical images of galaxies to recover images of protoplanetary disks from the DSHARP survey. We demonstrate that our method produces plausible posterior samples despite the misspecified galaxy prior.\\nWe show that our approach produces results which are competitive with existing radio interferometry imaging algorithms.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents an empirical study, applying the proposed model to real-world data from the DSHARP survey.",
      "quote": "We test our pipeline on ALMA observations of 3 DSHARP protoplanetary disks [17] as first application of this method to radio interferometry data."
    },
    "primary_research_field": {
      "name": {
        "value": "Radio Astronomy",
        "justification": "The paper focuses on radio interferometry, a technique used in astronomy.",
        "quote": "The inverse imaging task in radio interferometry is a key limiting factor to retrieving Bayesian uncertainties in radio astronomy in a computationally effective manner."
      },
      "aliases": []
    },
    "sub_research_fields": [],
    "models": [
      {
        "name": {
          "value": "score-based model",
          "justification": "The paper refers to its model as a \\\"score-based model\\\" throughout, without giving it a specific name.",
          "quote": "Our score-based imaging algorithm’s results are shown to be competitive with existing radio interferometry imaging algorithms."
        },
        "aliases": [],
        "is_contributed": {
          "value": true,
          "justification": "The paper presents a new method for radio interferometry imaging using score-based generative models as priors.",
          "quote": "In this work, we use score-based generative models [14, 15] as principled priors [16] to perform Bayesian inference for radio interferometric imaging."
        },
        "is_executed": {
          "value": true,
          "justification": "The authors executed the model, trained it on galaxy images, and used it to generate images from the DSHARP protoplanetary disks dataset.",
          "quote": "We test our pipeline on ALMA observations of 3 DSHARP protoplanetary disks [17] as first application of this method to radio interferometry data."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper introduces a new score-based model for radio interferometry imaging and compares it to existing algorithms such as CLEAN and MPoL.",
          "quote": "Our method shows competitive resolution and dynamic range performance compared to MPoL and CLEAN."
        },
        "referenced_paper_title": {
          "value": "No referenced paper found",
          "justification": "No specific paper is referenced when mentioning the score-based model.",
          "quote": "No quote"
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 15699
  }
}