{
  "paper": "2402.08801.txt",
  "words": 14981,
  "extractions": {
    "title": {
      "value": "ChatGPT vs LLaMA: Impact, Reliability, and Challenges in Stack Overflow Discussions",
      "justification": "The title of the paper is mentioned in the beginning.",
      "quote": "ChatGPT vs LLaMA: Impact, Reliability, and Challenges in Stack Overflow Discussions"
    },
    "description": "Since its release in November 2022, ChatGPT has shaken up Stack Overflow, the premier platform for developers’ queries on programming and software development. Demonstrating an ability to generate instant, human-like responses to technical questions, ChatGPT has ignited debates within the developer community about the evolving role of human-driven platforms in the age of generative AI. Two months after ChatGPT’s release, Meta released its answer with its own Large Language Model (LLM) called LLaMA: the race was on. We conducted an empirical study analyzing questions from Stack Overflow and using these LLMs to address them. This way, we aim to ① measure user engagement evolution with Stack Overflow over time; ② quantify the reliability of LLMs’ answers and their potential to replace Stack Overflow in the long term; ③ identify and understand why LLMs fails; and ④ compare LLMs together. Our empirical results are unequivocal: ChatGPT and LLaMA challenge human expertise, yet do not outperform it for some domains, while a significant decline in user posting activity has been observed. Furthermore, we also discuss the impact of our findings regarding the usage and development of new LLMs.",
    "type": {
      "value": "empirical",
      "justification": "The paper is empirical as it conducts a study analyzing questions from Stack Overflow. ",
      "quote": "We conducted an empirical study analyzing questions from Stack Overflow and using these LLMs to address them."
    },
    "primary_research_field": {
      "name": {
        "value": "Software Development",
        "justification": "The paper's primary focus is on the impact of LLMs on software development, as evidenced by its analysis of Stack Overflow, a platform for developers.",
        "quote": "Since its release in November 2022, ChatGPT has shaken up Stack Overflow, the premier platform for developers’ queries on programming and software development."
      },
      "aliases": []
    },
    "sub_research_fields": [],
    "models": [
      {
        "name": {
          "value": "ChatGPT",
          "justification": "ChatGPT is the name of the model.",
          "quote": "Since its release in November 2022, ChatGPT has shaken up Stack Overflow"
        },
        "aliases": [
          "ChatGPT",
          "ChatGPT-3.5",
          "GPT-3.5-turbo"
        ],
        "is_contributed": {
          "value": false,
          "justification": "The paper does not contribute ChatGPT, it was developed by OpenAI.",
          "quote": "ChatGPT is a language model developed by OpenAI."
        },
        "is_executed": {
          "value": true,
          "justification": "The paper uses ChatGPT to answer Stack Overflow questions, meaning it was executed.",
          "quote": "We conducted an empirical study analyzing questions from Stack Overflow and using these LLMs to address them."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares ChatGPT to LLaMA in its ability to answer Stack Overflow questions.",
          "quote": "Our empirical results are unequivocal: ChatGPT and LLaMA challenge human expertise, yet do not outperform it for some domains, while a significant decline in user posting activity has been observed."
        },
        "referenced_paper_title": {
          "value": "ChatGPT",
          "justification": "The ChatGPT model itself is not introduced in a specific paper, but rather in a blog post.",
          "quote": "Furthermore, with the release of ChatGPT2, publicly available for the general audience, users have prompted them for different purposes, like simulating a Q&A online web forum."
        }
      },
      {
        "name": {
          "value": "LLaMA",
          "justification": "LLaMA is the name of the model.",
          "quote": "Two months after ChatGPT’s release, Meta released its answer with its own Large Language Model (LLM) called LLaMA: the race was on."
        },
        "aliases": [
          "LLaMA",
          "LLaMA-2",
          "LLaMA2-7b"
        ],
        "is_contributed": {
          "value": false,
          "justification": "The paper does not contribute LLaMA, it was developed by Meta.",
          "quote": "LLaMA, released by Meta AI, is a series of large language models that come with different sizes (e.g., 7, 13, and 70 billion parameters for LLaMA-2) (Touvron et al., 2023)."
        },
        "is_executed": {
          "value": true,
          "justification": "The paper uses LLaMA to answer Stack Overflow questions, meaning it was executed.",
          "quote": "We conducted an empirical study analyzing questions from Stack Overflow and using these LLMs to address them."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares LLaMA to ChatGPT in its ability to answer Stack Overflow questions.",
          "quote": "Our empirical results are unequivocal: ChatGPT and LLaMA challenge human expertise, yet do not outperform it for some domains, while a significant decline in user posting activity has been observed."
        },
        "referenced_paper_title": {
          "value": "Llama 2: Open foundation and fine-tuned chat models",
          "justification": "The paper references a paper when introducing LLaMA.",
          "quote": "LLaMA, released by Meta AI, is a series of large language models that come with different sizes (e.g., 7, 13, and 70 billion parameters for LLaMA-2) (Touvron et al., 2023)."
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 24627
  }
}