{
  "paper": "2403.05564.txt",
  "words": 8855,
  "extractions": {
    "title": {
      "value": "Promoting Fair Vaccination Strategies Through Influence Maximization: A Case Study on COVID-19 Spread",
      "justification": "This is the title of the paper.",
      "quote": "Promoting Fair Vaccination Strategies Through Influence Maximization: A Case Study on COVID-19 Spread Nicola Neophytou1,2 , Afaf Taı̈k1,2 , Golnoosh Farnadi1,2,3 1"
    },
    "description": "This paper investigates fair vaccination strategies for mitigating disease spread, using COVID-19 as a case study. The authors leverage influence maximization (IM) on mobility networks, considering demographics like race, social status, and age to optimize vaccine distribution. They demonstrate their approach on mobility networks of three major US metropolitan areas, showing its effectiveness in reducing disease transmission and promoting fairness.",
    "type": {
      "value": "empirical",
      "justification": "The paper presents empirical findings based on real-world data.",
      "quote": "Through extensive experiments conducted on Covid-19 spread in three major metropolitan areas across the United States, we demonstrate the effectiveness of our proposed approach in reducing disease transmission and promoting fairness in vaccination distribution."
    },
    "primary_research_field": {
      "name": {
        "value": "Artificial Intelligence",
        "justification": "The paper relates to fairness in AI.",
        "quote": "Fairness in AI is an expanding area of research which has seen traction since the exposure of biases in several significant technologies (Mehrabi et al. 2021; Buolamwini and Gebru 2018; Angwin et al. 2016)."
      },
      "aliases": [
        "AI",
        "Artificial Intelligence"
      ]
    },
    "sub_research_fields": [
      {
        "name": {
          "value": "Influence Maximization",
          "justification": "The paper applies fairness constraints to the influence maximization problem.",
          "quote": "This extends to the field of influence maximization, where various works impose fairness constraints on the optimization problem."
        },
        "aliases": [
          "IM",
          "Influence Maximization"
        ]
      },
      {
        "name": {
          "value": "Epidemiology",
          "justification": "The paper utilizes mobility or contact networks used in epidemiology.",
          "quote": "This does not however consider the possibility of changing network structure over time, as is the case with mobility or contact networks used in epidemiology, and is therefore not extendable to the problem of vaccine distribution."
        },
        "aliases": [
          "Epidemiology"
        ]
      }
    ],
    "models": [
      {
        "name": {
          "value": "Influence Maximization",
          "justification": "The paper focuses on influence maximization as the primary modeling technique.",
          "quote": "In this study, we propose a novel approach that utilizes influence maximization (IM) on mobility networks to develop vaccination strategies which incorporate demographic fairness."
        },
        "aliases": [
          "IM",
          "influence maximization"
        ],
        "is_contributed": {
          "value": true,
          "justification": "The authors propose a novel community-level influence maximization approach for identifying impactful neighborhoods.",
          "quote": "A novel community-level influence maximization approach for identifying impactful neighborhoods, aiding targeted vaccination against disease transmission."
        },
        "is_executed": {
          "value": true,
          "justification": "The authors apply their influence maximization approach to mobility networks constructed from real-world data.",
          "quote": "Through extensive experiments conducted on Covid-19 spread in three major metropolitan areas across the United States, we demonstrate the effectiveness of our proposed approach in reducing disease transmission and promoting fairness in vaccination distribution."
        },
        "is_compared": {
          "value": true,
          "justification": "The paper compares influence maximization with other vaccination strategies, such as random vaccination and prioritizing older communities.",
          "quote": "We leverage an approach called influence maximization (IM), a network science technique designed to detect the most influential members of social networks, typically used in applications such as viral marketing campaigns (Chen, Wang, and Wang 2010)."
        },
        "referenced_paper_title": {
          "value": "Maximizing the spread of influence through a social network",
          "justification": "The authors reference a seminal work on influence maximization by Kempe et al.",
          "quote": "In their seminal work, Kempe et al. (Kempe, Kleinberg, and Tardos 2015) proposed a greedy algorithm which achieves (1 − 1e ) optimality guarantees on the seed set, so long as the objective function - which is the given propagation function - is both submodular and monotonic."
        }
      }
    ],
    "datasets": [],
    "libraries": []
  },
  "usage": {
    "cached_content_token_count": 0,
    "candidates_token_count": 0,
    "prompt_token_count": 0,
    "total_token_count": 15278
  }
}