{
  "description": "This paper introduces CommonAccent, a benchmark dataset optimized for accent classification in multiple languages using large acoustic pre-trained models like Wav2Vec 2.0/XLSR and ECAPA-TDNN. The study fine-tunes these models on subsets of the Common Voice dataset, achieving new state-of-the-art results in English accent classification and evaluates the performance across other languages including German, Spanish, and Italian.",
  "title": {
    "value": "CommonAccent: Exploring Large Acoustic Pretrained Models for Accent Classification Based on Common Voice",
    "justification": "This accurately represents the focus of the paper as stated in the provided text.",
    "quote": "CommonAccent: Exploring Large Acoustic Pretrained Models for Accent Classification Based on Common Voice"
  },
  "type": {
    "value": "empirical study",
    "justification": "The paper reports experimental results on training and evaluating models for accent classification using specific datasets.",
    "quote": "In this work, we study the accent classification problem,...Our contributions are four-fold as follows:...We set the first baseline for accent classification based on Common Voice dataset [10]..."
  },
  "research_field": {
    "value": "Speech Recognition",
    "justification": "The paper focuses on improving automatic speech recognition systems by incorporating accent classification.",
    "quote": "Despite the recent advancements in Automatic Speech Recognition (ASR), the recognition of accented speech still remains a dominant problem."
  },
  "sub_research_field": {
    "value": "Accent Classification",
    "justification": "The main objective of the paper is to address the problem of accent classification within speech recognition systems.",
    "quote": "We address multilingual accent classification through the ECAPA-TDNN and Wav2Vec 2.0/XLSR architectures..."
  },
  "models": [
    {
      "name": {
        "value": "ECAPA-TDNN",
        "justification": "This model is evaluated for its performance in accent classification in the paper.",
        "quote": "We address multilingual accent classification through the ECAPA-TDNN and Wav2Vec 2.0/XLSR architectures..."
      },
      "role": "used",
      "type": {
        "value": "TDNN-based Model",
        "justification": "The model is described as Emphasized Channel Attention, Propagation and Aggregation in TDNN Based Speaker Verification.",
        "quote": "ECAPA-TDNN: Emphasized Channel Attention, Propagation and Aggregation in TDNN Based Speaker Verification"
      },
      "mode": "fine-tuned"
    },
    {
      "name": {
        "value": "Wav2Vec 2.0",
        "justification": "",
        "quote": "We address multilingual accent classification through the ECAPA-TDNN and Wav2Vec 2.0/XLSR architectures..."
      },
      "role": "Used",
      "type": {
        "value": "Self-supervised learning model",
        "justification": "",
        "quote": "A. Baevski, Y. Zhou, A. Mohamed, and M. Auli, “wav2vec 2.0: A framework for self-supervised learning of speech representations,” Advances in Neural Information Processing Systems, vol. 33, pp. 12 449–12 460, 2020."
      },
      "mode": "fine-tuned"
    },
    {
      "name": {
        "value": "Wav2Vec 2.0/XLSR",
        "justification": "This model is evaluated for its performance in accent classification in the paper.",
        "quote": "We address multilingual accent classification through the ECAPA-TDNN and Wav2Vec 2.0/XLSR architectures..."
      },
      "role": "used",
      "type": {
        "value": "Self-supervised Model",
        "justification": "Wav2Vec 2.0/XLSR is described as a framework for self-supervised learning of speech representations.",
        "quote": "A. Baevski, Y. Zhou, A. Mohamed, and M. Auli, “wav2vec 2.0: A framework for self-supervised learning of speech representations,” Advances in Neural Information Processing Systems, vol. 33, pp. 12 449–12 460, 2020."
      },
      "mode": "fine-tuned"
    }
  ],
  "datasets": [
    {
      "name": {
        "value": "Common Voice",
        "justification": "",
        "quote": "Our recipe utilizes data from Common Voice [10] dataset in four different languages, namely: English, German, Spanish, and Italian."
      },
      "role": "used"
    },
    {
      "name": {
        "value": "Common Voice 11.0",
        "justification": "The dataset is used for training and evaluating the models for German, Spanish, and Italian accent classification.",
        "quote": "In this work, we study the accent classification problem, which is a critical building block towards accent-aware ASR... Our recipe utilizes data from Common Voice 7.0 dataset in four different languages, namely: English, German, Spanish, and Italian."
      },
      "role": "used"
    },
    {
      "name": {
        "value": "Common Voice 7.0",
        "justification": "The dataset is used for training and evaluating the models for English accent classification.",
        "quote": "In this work, we study the accent classification problem, which is a critical building block towards accent-aware ASR... Our recipe utilizes data from Common Voice 7.0 dataset in four different languages, namely: English, German, Spanish, and Italian."
      },
      "role": "used"
    },
    {
      "name": {
        "value": "CommonAccent",
        "justification": "",
        "quote": "We introduce CommonAccent, a subset of Common Voice compiled as a benchmark dataset optimized for accent classification in multiple languages"
      },
      "role": "contributed"
    }
  ],
  "libraries": [
    {
      "name": {
        "value": "SpeechBrain",
        "justification": "The SpeechBrain toolkit is used for implementing the accent classification recipe in the paper.",
        "quote": "Specifically, in this work, we introduce a simple-to-follow recipe on the SpeechBrain [6] toolkit to perform accent classification based on speech recordings."
      },
      "role": "used"
    }
  ]
}