{
  "description": "This paper investigates the differences in handover behavior when humans transfer hazardous objects versus safe objects using a high-resolution touch sensor. It highlights how these findings can inform safer human-robot interactions.",
  "title": {
    "value": "A Study of Human-Robot Handover through Human-Human Object Transfer",
    "justification": "This title accurately represents the paper's content, focusing on human-robot handover through human-human object transfer.",
    "quote": "A Study of Human-Robot Handover through Human-Human Object Transfer"
  },
  "type": {
    "value": "Empirical Study",
    "justification": "The paper involves conducting experiments to observe handover behavior, making it an empirical study.",
    "quote": "we propose a methodology to study human-human handover using a haptic hand-held tactile device."
  },
  "research_field": {
    "value": "Human-Computer Interaction",
    "justification": "The paper focuses on understanding human-robot interactions, which is a core area in the field of Human-Computer Interaction.",
    "quote": "In this paper, we consider the exchange of objects between humans and robots, as well as the contextual factors that modulate this behaviour."
  },
  "sub_research_field": {
    "value": "Haptics and Tactile Interaction",
    "justification": "The paper emphasizes the role of tactile feedback in handover interactions, making it fall under the sub-field of haptics and tactile interaction.",
    "quote": "we investigate changes in handover behaviour when transferring hazardous objects with the help of a high-resolution touch sensor."
  },
  "models": [],
  "datasets": [
    {
      "name": {
        "value": "Human-Human Handover Dataset (Control)",
        "justification": "This dataset represents the control study of human-human handovers without any tactile sensors.",
        "quote": "the first where one participant wears the visuotactile sensor and a control study where neither participants had sensors."
      },
      "role": "Used"
    },
    {
      "name": {
        "value": "Human-Human Handover Dataset (Haptic Sensor)",
        "justification": "The dataset involves recordings of human-human handovers using a haptic sensor to collect tactile and visual data.",
        "quote": "We design a wrist-mounted tactile enabled finger that allows researchers to collect large datasets of human-human handover interactions while recording visual and tactile sensory feedback."
      },
      "role": "Used"
    }
  ],
  "libraries": []
}